Repository: inveniosoftware/invenio-oauthclient
Catalog: invenio_oauthclient/translations/*/LC_MESSAGES/messages.po
Languages: ar, de, fi, sv

source: ID
ar: معرّف
fi: Tunnus

source: User ID
ar: معرّف المستخدم
de: Benutzer*innen-ID
fi: Käyttäjän tunnus
sv: Användar-ID

source: Client ID
ar: معرّف حريف
fi: Client-tunnus
sv: Klient ID

source: ID Remote Account
ar: معرّف حساب خارجي
de: ID des externen Kontos
fi: Etätilin tunnus
sv: ID fjärrkonto

source: User Management
ar: إدارة المستخدم
de: Benutzer*innen-Verwaltung
fi: Käyttäjähallinta
sv: Hantera Användare

source: Linked accounts
ar: الحسابات المرتبطة
de: Verknüpfte Konten
fi: Linkitetyt tilit
sv: Länkade konton

source: Linked account tokens
ar: الرموز المميزة للحساب المرتبط
de: Verknüpfte Konto-Token
fi: Linkitettyjen tilien tunnukset
sv: Länkade kontotokens

source: %(icon)s Linked accounts
ar: %(icon)s حسابات مرتبطة
de: %(icon)s Verknüpfte Konten
fi: %(icon)s Linkitetyt tilit
sv: %(icon)s Länkade konton

source: Identity class %(identity_class)s is not one of [%(valid_identities)s]
ar: فئة الهوية Identity class %(identity_class)s ليست واحدة من [%(valid_identities)s]
de: Identitätsklasse %(identity_class)s ist keine der folgenden: [%(valid_identities)s]
fi: Identiteettiluokka %(identity_class)s ei ole joukossa [%(valid_identities)s]
sv: Identitets klass %(identity_class)s är inte en av [%(valid_identities)s]

source: CERN account not allowed.
ar: حساب CERN غير مسموح به.
de: CERN-Konto nicht erlaubt.
fi: CERN-tili ei ole sallittu.
sv: CERN-konto är inte tillåtet.

source: User roles %(cern_roles)s are not one of %(valid_roles)s
ar: أدوار المستخدم %(cern_roles)s ليست واحدة من %(valid_roles)s
de: Benutzerrollen %(cern_roles)s sind keine der folgenden: %(valid_roles)s
fi: Käyttäjäroolit %(cern_roles)s eivät kuulu joukkoon %(valid_roles)s
sv: Användarroller %(cern_roles)s är inte en av %(valid_roles)s

source: GitHub
ar: جيت هوب GitHub

source: Software collaboration platform.
ar: منصة تعاون للبرمجة.
de: Software-Kollaborationsplattform.
fi: Ohjelmistoyhteistyöalusta.
sv: Mjukvaru-samarbetsplattform

source: Application mis-configuration in GitHub
ar: خطأ في تثبيت إعدادات التطبيق في GitHub
de: Falsche Anwendungskonfiguration in GitHub
fi: Sovelluksen virheellinen konfigurointi GitHubissa
sv: Applikation felkonfigurerad i GitHub

source: Globus
ar: غلوبس Globus

source: Research data management simplified.
ar: إدارة بيانات البحث مبسّطة.
de: Vereinfachte Forschungsdatenverwaltung.
fi: Tutkimusdatan hallinta yksinkertaistettuna.
sv: Forskningsdatahantering på ett enklare sätt

source: Application mis-configuration in Globus
ar: خطأ في تثبيت إعدادات التطبيق في Globus
de: Falsche Anwendungskonfiguration in Globus
fi: Sovelluksen virheellinen konfigurointi Globuksessa
sv: Applikationen är felkonfigurerad i Globus

source: Failed to fetch user id, likely server mis-configuration
ar: فشل جلب معرف id المستخدم، ربما يكون هناك خطأ في تثبيت إعدادات الموزّع
de: Benutzer*innen-ID konnte nicht abgerufen werden, wahrscheinlich aufgrund einer falschen Serverkonfiguration.
fi: Käyttäjätunnuksen noutaminen epäonnistui, todennäköisesti palvelimen virheellinen konfiguraatio
sv: Misslyckad hämtning av user id, troligen på grund av felkonfigurering av server

source: Open Science Services.
ar: خدمات العلم المفتوح.
de: Dienste für Open Science.
fi: Avoimen tieteen palvelut.
sv: Open Science relaterade tjänster.

source: ORCID
ar: أوركيد ORCID

source: Connecting Research and Researchers.
ar: ربط التواصل بين البحث والباحثين.
de: Forschung und Forschende verbinden.
fi: Yhdistää tutkimuksen ja tutkijat.
sv: Sammanför forskning och forskare

source: Invalid app name %(app_name)s. It should only contain letters, numbers, dashes and underscores
ar: اسم التطبيق غير صالح %(app_name)s. يجب أن يحتوي على أحرف وأرقام وشرطات وشرطات سفلية فقط.
de: Ungültiger Anwendungsname %(app_name)s. Er sollte nur Buchstaben, Zahlen, Bindestriche und Unterstriche enthalten.
fi: Virheellinen sovelluksen nimi %(app_name)s. Sen tulee sisältää vain kirjaimia, numeroita, viivoja ja alaviivoja
sv: Ogiltigt applikationsnamn %(app_name)s. Namnet får enbart bestå av bokstäver, siffror och streck

source: Authorization with remote service failed.
ar: فشل الإذن بالخدمة عن بعد.
de: Autorisierung mit externem Dienst fehlgeschlagen.
fi: Valtuutus etäpalvelussa epäonnistui.
sv: Auktorisering med fjärrservice misslyckades.

source: You rejected the authentication request.
ar: لقد رفضت طلب المصادقة.
de: Sie haben die Authentifizierungs-Anfrage abgelehnt.
fi: Hylkäsit todennuspyynnön.
sv: Du avvisade autentiseringsbegäran.

source: External service is already linked to another account.
ar: الخدمة الخارجية مرتبطة حاليا مع حساب أخر.
de: Der externe Dienst ist bereits mit einem anderen Konto verknüpft.
fi: Ulkoinen palvelu on jo linkitetty toiseen tiliin.
sv: Extern tjänst är redan länkad till ett annat konto.

source: Unauthorized.
ar: غير مرخّص
de: Nicht autorisiert.
fi: Luvaton.
sv: Obehörig

source: Successfully signed up.
ar: تم التسجيل بنجاح.
de: Erfolgreich angemeldet.
fi: Rekisteröityminen onnistui.
sv: Registreringen lyckades

source: Token not found.
ar: الرمز Token غير موجود
de: Token nicht gefunden.
fi: Tunnusta ei löytynyt.
sv: Token hittades inte

source: Could not create token for user.
ar: لم يتمكن من إنشاء رمز token للمستخدم.
de: Konnte keinen Token für Benutzer*in erstellen.
fi: Käyttäjälle ei voitu luoda tunnusta.
sv: Det gick inte att skapa en token för användaren.

source: Successfully authorized.
ar: تمت الموافقة على الإذن بنجاح.
de: Erfolgreich autorisiert.
fi: Valtuutus onnistui.
sv: Auktoriseringen lyckades

source: Successfully disconnected.
ar: تم قطع الاتصال بنجاح.
de: Erfolgreich getrennt.
fi: Yhteyden purku onnistui.
sv: Frånkoppling lyckades.

source: User rejected request.
ar: تم رفض الطلب من قبل المستخدم.
de: Benutzer*in hat die Anfrage abgelehnt.
fi: Käyttäjä hylkäsi pyynnön.
sv: Användaren har nekat förfrågan.

source: Bad OAuth authorized request
ar: طلب تفويض OAuth غير صالح
de: Ungültige OAuth-Autorisierungsanfrage
fi: Virheellinen OAuth-valtuutuspyyntö
sv: Ogiltig OAuth auktoriseringsförfrågan

source: A confirmation email has already been sent to %(email)s. Didn't receive it? Click <strong><a href="%(url)s">here</a></strong> to resend it.
ar: تم إرسال رسالة تأكيد إلى %(email)s. إن لم تستلمها؟ انقر <strong><a href="%(url)s">هنا</a></strong> لإعادة إرسالها.
de: Eine Bestätigungs-E-Mail wurde bereits an %(email)s gesendet. Haben Sie sie nicht erhalten? Klicken Sie <strong><a href="%(url)s">hier</a></strong>, um sie erneut zu senden.
fi: Vahvistussähköposti on jo lähetetty osoitteeseen %(email)s. Etkö saanut sitä? Lähetä uudelleen napsauttamalla <strong><a href="%(url)s”>tästä</a></strong>.
sv: Ett bekräftelsemail har redan skickats till %(email)s. Har du inte fått det? Klicka <strong><a href="%(url)s">här</a></strong> för att skicka det igen.

source: Error while syncing roles: A managed role with id: %(group_id)s already exists
ar: حدث خطأ أثناء مزامنة الأدوار: يوجد دور بصدد الإدارة يحمل المعرف id: %(group_id)sبالفعل
de: Fehler beim Synchronisieren von Rollen: Eine verwaltete Rolle mit der ID: %(group_id)s existiert bereits
fi: Virhe rooleja synkronoitaessa: Hallittu rooli tunnuksella %(group_id)s on jo olemassa
sv: Fel uppstod vid synkning av roller: En hanterad roll med id: %(group_id)s finns redan

source: Error while syncing roles: A managed role with name: %(group_name)s already exists
ar: حدث خطأ أثناء مزامنة الأدوار: يوجد دور بصدد الإدارة يحمل إسم: %(group_name)s بالفعل
de: Fehler beim Synchronisieren von Rollen: Eine verwaltete Rolle mit dem Namen: %(group_name)s existiert bereits
fi: Virhe rooleja synkronoitaessa: Hallittu rooli nimellä %(group_name)s on jo olemassa
sv: Fel uppstod vid synkning av roller: En hanterad roll med namn: %(group_name)s finns redan

source: Sign in with %(title)s
ar: الاشتراك مع %(title)s
de: Mit %(title)s einloggen
fi: Kirjaudu sisään palvelulla %(title)s
sv: Logga in med %(title)s

source: OR
ar: أو
de: ODER
fi: TAI
sv: ELLER

source: Sign-up with %(title)s!
ar: الاشتراك مع %(title)s!
de: Registrieren Sie sich mit %(title)s!
fi: Rekisteröidy palvelulla %(title)s!
sv: Registrera med %(title)s!

source: Fill in your details to complete your registration. You only have to do this once.
ar: املأ بياناتك لإكمال تسجيلك. ما عليك سوى القيام بذلك مرة واحدة.
de: Tragen Sie bitte Ihre Daten ein, um die Registrierung abzuschließen. Dies ist nur einmalig nötig.
fi: Täytä tietosi rekisteröinnin viimeistelemiseksi. Tämä tarvitsee tehdä vain kerran.
sv: Fyll i dina uppgifter för att slutföra din registrering. Du behöver bara göra detta en gång.

source: Complete registration
ar: أتمم التسجيل
de: Registrierung abschließen
fi: Viimeistele rekisteröinti
sv: Slutför registreringen

source: Tired of entering password for %(sitename)s every time you sign in? Set up single sign-on with one or more of the services below:
ar: هل سئمت تكرار إدخال كلمة المرور عند تسجيل الدخول في %(sitename)s؟ قم بإعداد تسجيل الدّخول مرّة واحدة في خدمة او خدمات أسفله:
de: Wollen Sie nicht jedes Mal beim Einloggen auf %(sitename)s Ihr Passwort eingeben? Verwenden Sie das Single-Sign-On mit einem der folgenden Dienste:
fi: Kyllästyttääkö salasanan syöttäminen palveluun %(sitename)s aina kirjautuessa? Ota käyttöön kertakirjautuminen yhden tai useamman alla olevan palvelun avulla:
sv: Trött på att ange lösenord för %(sitename)s varje gång du loggar in? Konfigurera enkel inloggning med en eller flera av tjänsterna nedan:

source: Disconnect
ar: قطع الاتصال
de: Trennen
fi: Pura yhteys
sv: Koppla ifrån

source: Connect
ar: قم بالتوصيل
de: Verbinden
fi: Yhdistä
sv: Anslut

source: Forgot password?
ar: فقدت كلمة المرور؟
de: Passwort vergessen?
fi: Unohditko salasanan?
sv: Glömt ditt lösenord?

source: Resend confirmation email
ar: أعد إرسال تأكيد البريد الإلكتروني
de: Bestätigungs-Mail erneut senden
fi: Lähetä vahvistussähköposti uudelleen
sv: Skicka om bekräftelsemejl
